wrk/async_res/wrk_get.txt
Running 20s test @ http://127.0.0.1:8080
  2 threads and 1024 connections
  Thread calibration: mean lat.: 0.746ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.751ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   758.54us  301.92us   3.45ms   59.59%
    Req/Sec     3.53k   398.98     4.89k    66.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  742.00us
 75.000%    1.03ms
 90.000%    1.16ms
 99.000%    1.31ms
 99.900%    1.39ms
 99.990%    2.52ms
 99.999%    3.45ms
100.000%    3.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.161     0.000000            1         1.00
       0.345     0.100000         4979         1.11
       0.457     0.200000         9996         1.25
       0.545     0.300000        14923         1.43
       0.656     0.400000        19939         1.67
       0.742     0.500000        24866         2.00
       0.822     0.550000        27392         2.22
       0.861     0.600000        29845         2.50
       0.896     0.650000        32317         2.86
       0.954     0.700000        34820         3.33
       1.029     0.750000        37318         4.00
       1.049     0.775000        38590         4.44
       1.066     0.800000        39830         5.00
       1.083     0.825000        41081         5.71
       1.100     0.850000        42264         6.67
       1.122     0.875000        43500         8.00
       1.137     0.887500        44127         8.89
       1.159     0.900000        44757        10.00
       1.186     0.912500        45379        11.43
       1.209     0.925000        46017        13.33
       1.228     0.937500        46614        16.00
       1.236     0.943750        46921        17.78
       1.244     0.950000        47232        20.00
       1.252     0.956250        47545        22.86
       1.262     0.962500        47877        26.67
       1.270     0.968750        48184        32.00
       1.274     0.971875        48337        35.56
       1.279     0.975000        48492        40.00
       1.284     0.978125        48625        45.71
       1.290     0.981250        48809        53.33
       1.295     0.984375        48941        64.00
       1.298     0.985938        49014        71.11
       1.302     0.987500        49102        80.00
       1.306     0.989062        49182        91.43
       1.310     0.990625        49249       106.67
       1.315     0.992188        49331       128.00
       1.318     0.992969        49364       142.22
       1.322     0.993750        49409       160.00
       1.327     0.994531        49444       182.86
       1.332     0.995313        49483       213.33
       1.340     0.996094        49524       256.00
       1.343     0.996484        49540       284.44
       1.348     0.996875        49559       320.00
       1.355     0.997266        49580       365.71
       1.361     0.997656        49597       426.67
       1.367     0.998047        49616       512.00
       1.373     0.998242        49625       568.89
       1.377     0.998437        49637       640.00
       1.381     0.998633        49645       731.43
       1.386     0.998828        49655       853.33
       1.396     0.999023        49666      1024.00
       1.402     0.999121        49670      1137.78
       1.409     0.999219        49674      1280.00
       1.415     0.999316        49679      1462.86
       1.426     0.999414        49683      1706.67
       1.442     0.999512        49688      2048.00
       1.673     0.999561        49691      2275.56
       1.735     0.999609        49693      2560.00
       1.858     0.999658        49696      2925.71
       1.944     0.999707        49698      3413.33
       2.097     0.999756        49700      4096.00
       2.241     0.999780        49702      4551.11
       2.373     0.999805        49703      5120.00
       2.381     0.999829        49704      5851.43
       2.403     0.999854        49705      6826.67
       2.459     0.999878        49706      8192.00
       2.519     0.999890        49707      9102.22
       2.579     0.999902        49708     10240.00
       2.579     0.999915        49708     11702.86
       3.019     0.999927        49709     13653.33
       3.019     0.999939        49709     16384.00
       3.091     0.999945        49710     18204.44
       3.091     0.999951        49710     20480.00
       3.091     0.999957        49710     23405.71
       3.249     0.999963        49711     27306.67
       3.249     0.999969        49711     32768.00
       3.249     0.999973        49711     36408.89
       3.249     0.999976        49711     40960.00
       3.249     0.999979        49711     46811.43
       3.455     0.999982        49712     54613.33
       3.455     1.000000        49712          inf
#[Mean    =        0.759, StdDeviation   =        0.302]
#[Max     =        3.454, Total count    =        49712]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  134749 requests in 20.00s, 8.59MB read
  Socket errors: connect 5, read 0, write 0, timeout 2260
Requests/sec:   6737.83
Transfer/sec:    439.78KB